/*******************************************************************/
/*                      TFT液晶屏測試程式                           */
/*                                                                 */
/* 硬件平臺: HL-K18+18LF4520   晶振：10MHZ（4倍頻）                  */ 
/* 軟件平臺: MAPLAB+MCC18                                           */
/* 描述：在TFT上顯示彩條和單色彩色。                                 */
/* ---------------------------------------------------------------------*/ 
/* TFT彩屏模組和18F4520的連線：                                      	*/ 
/* 將TCS、RS、RW、EN處的4個短路帽移動到上方，其他短路帽保持出廠位置，   */
/* 即可方便快速地完成下述連線：                                         */
/* TFT_RS（數據/命令選擇）---- RA2                               	*/ 	
/*            TFT_WR（寫）---- RA3                                      */ 
/*            TFT_RD（讀）---- RA5                                      */ 
/*          TFT_CS（片選）---- RA1                                      */ 
/*         TFT_RST（復位）---- RB3                                      */ 
/*   TFT_DATA（8位數據口）---- PORTD                                    */ 
/* ---------------------------------------------------------------------*/
/*******************************************************************/
#include	<p18cxxx.h>/*包含18F系列微控制器標頭檔案*/
#include "k18.h"/*包含K18開發板標頭檔案*/
#include "LCM/ILI9325.h"
#include "delay.h"/*包含延時函式標頭檔案*/


void main(void)/*主函式*/
{
	unsigned char i, x;
	unsigned int y;
   
	k18_init();/*K18主板初始化*/
	delay20ms();
	ILI9325_initial();/*TFT彩屏初始化*/
	delay20ms();
	
	while(1)
    {
		LCD_test();/*呼叫彩條、單色自測程式*/
	}

}


